# TagTypeId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiReferenceAnnotationType..::..TagTypeId Property
MultiReferenceAnnotationType Class See Also
---
The tag type which will be used by the child tag the multi-reference annotation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ElementId TagTypeId { get; set; }
```

Visual Basic
---
```text
Public Property TagTypeId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ TagTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# ### Field Value
The tag type must be able to tag elements belonging to the multi-reference annotation's reference category.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The tag type is not allowed. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
MultiReferenceAnnotationType Class
Autodesk.Revit.DB Namespace